kEpsilon/constant/polyMesh/boundary
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class polyBoundaryMesh;
 location "constant/polyMesh";
 object boundary;
}

(
  FrontAndBack

  {
    type empty;
    physicalType patch;
    nFaces 82228;
    startFace 68557;

  }
  patch1

  {
    type wall;
    physicalType patch;
    nFaces 98;
    startFace 150785;

  }
  patch2

  {
    type wall;
    physicalType patch;
    nFaces 98;
    startFace 150883;

  }
  patch3

  {
    type wall;
    physicalType patch;
    nFaces 98;
    startFace 150981;

  }
  Shaft

  {
    type wall;
    physicalType patch;
    nFaces 18;
    startFace 151079;

  }
  Inlet

  {
    type patch;
    physicalType patch;
    nFaces 39;
    startFace 151097;

  }
  Lat-Wall

  {
    type wall;
    physicalType patch;
    nFaces 78;
    startFace 151136;

  }
  Outlet

  {
    type patch;
    physicalType patch;
    nFaces 39;
    startFace 151214;

  }
  AMI-St

  {
    type cyclicAMI;
neighbourPatch AMI-Rt;
 matchTolerance 1e-4; 
 transform noOrdering;
    physicalType patch;
    nFaces 164;
    startFace 151253;

  }
  AMI-Rt

  {
    type cyclicAMI;
neighbourPatch AMI-St;
 matchTolerance 1e-4; 
 transform noOrdering;
    physicalType patch;
    nFaces 164;
    startFace 151417;

  }
)


// ************************************************************************* //